In [1]:
import pandas as pd
from sqlalchemy import create_engine
import numpy as np 
#import seaborn as sns

In [2]:
# replace "123456" with your own password!!!!
# create a database named "global_store" before run this program
conn_url = 'postgresql://postgres:123456@localhost/global_store'

In [3]:
engine = create_engine(conn_url)

In [4]:
connection = engine.connect()

In [5]:
stmt = """
CREATE TABLE order_priority (
     Order_Priority_ID INTEGER,
     Order_Priority varchar(10) NOT NULL,
     PRIMARY KEY (Order_Priority_ID)
    );

    CREATE TABLE records (
         Row_ID INTEGER,
         Order_ID varchar(30) NOT NULL,
         Order_Date date,
         Customer_ID varchar(15) NOT NULL,
         Product_ID varchar(30) NOT NULL,
         Quantity INTEGER NOT NULL,
         Order_Priority_ID INTEGER,
         PRIMARY KEY (Row_ID)
    );

    CREATE TABLE products (
         Product_ID varchar(200),
         Product_Name varchar(200) NOT NULL,
         SubCategory_ID INTEGER,
         PRIMARY KEY (Product_ID)
    );

    CREATE TABLE categories (
         Category_ID INTEGER,
         Category varchar(30) NOT NULL,
         PRIMARY KEY (Category_ID)
    );

    CREATE TABLE subcategories (
         SubCategory_ID INTEGER,
         SubCategory varchar(30) NOT NULL,
         Category_ID INTEGER NOT NULL,
         PRIMARY KEY (SubCategory_ID),
         FOREIGN KEY (Category_ID) REFERENCES categories
    );

    CREATE TABLE financial_info (
         Order_ID varchar(30),
         Sales FLOAT,
         Profit FLOAT,
         PRIMARY KEY (Order_ID)

    );

    CREATE TABLE shipping_cost (
         Order_ID varchar(30),
         Shipping_Cost FLOAT,
         PRIMARY KEY (Order_ID),
         FOREIGN KEY (Order_ID) REFERENCES financial_info

    );

    CREATE TABLE discount (
         Order_ID varchar(30),
         Discount FLOAT,
         PRIMARY KEY (Order_ID),
         FOREIGN KEY (Order_ID) REFERENCES shipping_cost,
         FOREIGN KEY (Order_ID) REFERENCES financial_info
    );

    CREATE TABLE segments (
         Segment_ID INTEGER,
         Segment varchar(15) NOT NULL,
         PRIMARY KEY (Segment_ID)
    );

    CREATE TABLE customers(
         Customer_ID varchar(15),
         Customer_Name varchar(50) NOT NULL,
         Segment_ID integer,
         PRIMARY KEY (Customer_ID)
    );

    CREATE TABLE customer_location(
         Customer_ID varchar(15),
         City varchar(50) NOT NULL,
         State varchar(50) NOT NULL,
         Country varchar(50) NOT NULL,
         PRIMARY KEY (Customer_ID)
    );

    CREATE TABLE markets (
         Market_ID INTEGER,
         Market varchar(10) NOT NULL,
         PRIMARY KEY (Market_ID)
    );


    CREATE TABLE countries (
         Country varchar(50),
         Market_ID integer,
         PRIMARY KEY (Country),
         FOREIGN KEY (Market_ID) REFERENCES markets
    );

    CREATE TABLE ship_modes (
         Ship_Mode_ID INTEGER,
         Ship_Mode varchar(15) NOT NULL,
         PRIMARY KEY (Ship_Mode_ID)
    );

    CREATE TABLE shipping_info (
         Order_ID varchar(30),
         Ship_Date DATE,
         Ship_Mode_ID INTEGER,
         PRIMARY KEY (Order_ID),
         FOREIGN KEY (Ship_Mode_ID) REFERENCES ship_modes
    );

    CREATE TABLE order_location (
         Order_ID varchar(30),
         City varchar(50) NOT NULL,
         State varchar(50) NOT NULL,
         Country varchar(50) NOT NULL,
         Postal_Code varchar(10),
         PRIMARY KEY (Order_ID),
         FOREIGN KEY (Order_ID) REFERENCES shipping_cost,
         FOREIGN KEY (Order_ID) REFERENCES discount,
         FOREIGN KEY (Order_ID) REFERENCES financial_info
    );
    
"""

In [6]:
connection.execute(stmt)

In [7]:
df = pd.read_csv('Global_Superstore2.csv',encoding= 'unicode_escape')

In [8]:
len(df)

51290

In [9]:
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
0,32298,CA-2012-124891,31-07-2012,31-07-2012,Same Day,RH-19495,Rick Hansen,Consumer,New York City,New York,...,TEC-AC-10003033,Technology,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...,2309.650,7,0.0,762.1845,933.57,Critical
1,26341,IN-2013-77878,05-02-2013,07-02-2013,Second Class,JR-16210,Justin Ritter,Corporate,Wollongong,New South Wales,...,FUR-CH-10003950,Furniture,Chairs,"Novimex Executive Leather Armchair, Black",3709.395,9,0.1,-288.7650,923.63,Critical
2,25330,IN-2013-71249,17-10-2013,18-10-2013,First Class,CR-12730,Craig Reiter,Consumer,Brisbane,Queensland,...,TEC-PH-10004664,Technology,Phones,"Nokia Smart Phone, with Caller ID",5175.171,9,0.1,919.9710,915.49,Medium
3,13524,ES-2013-1579342,28-01-2013,30-01-2013,First Class,KM-16375,Katherine Murray,Home Office,Berlin,Berlin,...,TEC-PH-10004583,Technology,Phones,"Motorola Smart Phone, Cordless",2892.510,5,0.1,-96.5400,910.16,Medium
4,47221,SG-2013-4320,05-11-2013,06-11-2013,Same Day,RH-9495,Rick Hansen,Consumer,Dakar,Dakar,...,TEC-SHA-10000501,Technology,Copiers,"Sharp Wireless Fax, High-Speed",2832.960,8,0.0,311.5200,903.04,Critical

In [10]:
df = df.rename(columns={'Row ID': 'row_id', 'Order ID': 'order_id', 'Order Date':'order_date',\
                       'Ship Date':'ship_date', 'Ship Mode':'ship_mode', 'Customer ID':'customer_id',\
                       'Customer Name':'customer_name', 'Segment':'segment', 'City':'city', 'State':'state',\
                       'Country':'country', 'Postal Code':'postal_code', 'Market':'market',\
                       'Region':'region', 'Product ID':'product_id', 'Category':'category',\
                       'Sub-Category':'subcategory', 'Product Name':'product_name', 'Sales':'sales',\
                       'Quantity':'quantity', 'Discount':'discount', 'Profit':'profit', 'Shipping Cost':'shipping_cost','Order Priority':'order_priority'})
df["order_date"] = pd.to_datetime(df["order_date"], format = '%d-%m-%Y')
df["ship_date"] = pd.to_datetime(df["ship_date"], format = '%d-%m-%Y')
df.head()

,row_id,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,city,state,...,product_id,category,subcategory,product_name,sales,quantity,discount,profit,shipping_cost,order_priority
0,32298,CA-2012-124891,2012-07-31,2012-07-31,Same Day,RH-19495,Rick Hansen,Consumer,New York City,New York,...,TEC-AC-10003033,Technology,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...,2309.650,7,0.0,762.1845,933.57,Critical
1,26341,IN-2013-77878,2013-02-05,2013-02-07,Second Class,JR-16210,Justin Ritter,Corporate,Wollongong,New South Wales,...,FUR-CH-10003950,Furniture,Chairs,"Novimex Executive Leather Armchair, Black",3709.395,9,0.1,-288.7650,923.63,Critical
2,25330,IN-2013-71249,2013-10-17,2013-10-18,First Class,CR-12730,Craig Reiter,Consumer,Brisbane,Queensland,...,TEC-PH-10004664,Technology,Phones,"Nokia Smart Phone, with Caller ID",5175.171,9,0.1,919.9710,915.49,Medium
3,13524,ES-2013-1579342,2013-01-28,2013-01-30,First Class,KM-16375,Katherine Murray,Home Office,Berlin,Berlin,...,TEC-PH-10004583,Technology,Phones,"Motorola Smart Phone, Cordless",2892.510,5,0.1,-96.5400,910.16,Medium
4,47221,SG-2013-4320,2013-11-05,2013-11-06,Same Day,RH-9495,Rick Hansen,Consumer,Dakar,Dakar,...,TEC-SHA-10000501,Technology,Copiers,"Sharp Wireless Fax, High-Speed",2832.960,8,0.0,311.5200,903.04,Critical

In [11]:
# table 1: order priority table 
order_priority_id_df = pd.DataFrame(df.order_priority.unique(), columns=['order_priority'])
order_priority_id_df.insert(0, 'order_priority_id', range(1, 1 + len(order_priority_id_df)))
order_priority_id_df

order_priority_id_df.to_sql(name='order_priority', con=engine, if_exists='append', index=False)
order_priority_id_df

   order_priority_id order_priority
0                  1       Critical
1                  2         Medium
2                  3           High
3                  4            Low

In [12]:
# table 2: records 

records = df[['row_id','order_id', 'order_date', 'customer_id', 'product_id', 'quantity', 'order_priority']]
records.head()

order_priority_id_list = [order_priority_id_df.order_priority_id[order_priority_id_df.order_priority == i].values[0] for i in df.order_priority]
records.insert(7, 'order_priority_id', order_priority_id_list)

records_final = records.drop(['order_priority'],axis=1,inplace=False)

records_final.to_sql(name='records', con=engine, if_exists='append', index=False)
records_final

,row_id,order_id,order_date,customer_id,product_id,quantity,order_priority_id
0,32298,CA-2012-124891,2012-07-31,RH-19495,TEC-AC-10003033,7,1
1,26341,IN-2013-77878,2013-02-05,JR-16210,FUR-CH-10003950,9,1
2,25330,IN-2013-71249,2013-10-17,CR-12730,TEC-PH-10004664,9,2
3,13524,ES-2013-1579342,2013-01-28,KM-16375,TEC-PH-10004583,5,2
4,47221,SG-2013-4320,2013-11-05,RH-9495,TEC-SHA-10000501,8,1
...,...,...,...,...,...,...,...
51285,29002,IN-2014-62366,2014-06-19,KE-16420,OFF-FA-10000746,5,2
51286,35398,US-2014-102288,2014-06-20,ZC-21910,OFF-AP-10002906,1,2
51287,40470,US-2013-155768,2013-12-02,LB-16795,OFF-EN-10001219,3,3
51288,9596,MX-2012-140767,2012-02-18,RB-19795,OFF-BI-10000806,2,2
51289,6147,MX-2012-134460,2012-05-22,MC-18100,OFF-PA-10004155,3,3

In [13]:
# table 3: Categories

categories_id_df = pd.DataFrame(df.category.unique(), columns=['category'])
categories_id_df.insert(0, 'category_id', range(1, 1 + len(categories_id_df)))
categories_id_df 

categories_id_df.to_sql(name='categories', con=engine, if_exists='append', index=False)
categories_id_df

   category_id         category
0            1       Technology
1            2        Furniture
2            3  Office Supplies

In [14]:
# table 4: subcategories
df2 = df[['category','subcategory']]
category_id_list = [categories_id_df.category_id[categories_id_df.category == i].values[0] for i in df2.category]
df2.insert(2, 'category_id', category_id_list)
df2

sub_category_id_df = df2.drop_duplicates('subcategory').fillna(-1)[['subcategory','category','category_id']].reset_index().drop('index',axis=1)

sub_category_id_df.insert(0, 'subcategory_id', range(1, 1 + len(sub_category_id_df)))

sub_category_id_df2 = sub_category_id_df.drop('category',axis=1,inplace=False)

sub_category_id_df2.to_sql(name='subcategories', con=engine, if_exists='append', index=False)
sub_category_id_df2

    subcategory_id  subcategory  category_id
0                1  Accessories            1
1                2       Chairs            2
2                3       Phones            1
3                4      Copiers            1
4                5       Tables            2
5                6      Binders            3
6                7     Supplies            3
7                8   Appliances            3
8                9     Machines            1
9               10    Bookcases            2
10              11      Storage            3
11              12  Furnishings            2
12              13          Art            3
13              14        Paper            3
14              15    Envelopes            3
15              16    Fasteners            3
16              17       Labels            3

In [15]:
# table 5: products

print(len(df['product_id'].drop_duplicates()))
print(len(df['product_id']))

# thus, need to remove duplicate values in order to ensure product_id can be used as Primary Key

10292
51290

In [16]:
sub_category_id_list = [sub_category_id_df2.subcategory_id[sub_category_id_df2.subcategory == i].values[0] for i in df2.subcategory]

df3 = df[['product_id','product_name','subcategory']]
df3.insert(2, 'subcategory_id', sub_category_id_list)
df3

product_df = df3.drop_duplicates('product_id').fillna(-1)[['product_id','product_name','subcategory_id']].reset_index().drop('index',axis=1)
product_df

product_df.to_sql(name='products', con=engine, if_exists='append', index=False)
product_df

,product_id,product_name,subcategory_id
0,TEC-AC-10003033,Plantronics CS510 - Over-the-Head monaural Wir...,1
1,FUR-CH-10003950,"Novimex Executive Leather Armchair, Black",2
2,TEC-PH-10004664,"Nokia Smart Phone, with Caller ID",3
3,TEC-PH-10004583,"Motorola Smart Phone, Cordless",3
4,TEC-SHA-10000501,"Sharp Wireless Fax, High-Speed",4
...,...,...,...
10287,OFF-FA-10004112,"Stockwell Staples, 12 Pack",16
10288,OFF-BI-10003253,"Ibico Index Tab, Economy",6
10289,OFF-BI-10002510,"Acco Index Tab, Clear",6
10290,FUR-ADV-10002329,"Advantus Light Bulb, Erganomic",12
10291,OFF-AP-10002203,Eureka Disposable Bags for Sanitaire Vibra Gro...,8

In [17]:
# table 6: financial info
financial_info_df = df.groupby('order_id')[['sales','profit']].sum().reset_index()

financial_info_df.to_sql(name='financial_info', con=engine, if_exists='append', index=False)
financial_info_df

           order_id    sales   profit
0      AE-2011-9160  161.082 -246.078
1      AE-2013-1130  228.996 -236.964
2      AE-2013-1530   23.634  -38.076
3      AE-2014-2840   42.480  -75.060
4      AE-2014-3830  281.502 -429.108
...             ...      ...      ...
25030  ZI-2014-7160   51.075  -96.135
25031  ZI-2014-7610   25.578  -30.312
25032  ZI-2014-9540    7.164   -6.696
25033  ZI-2014-9550   72.801  -95.529
25034  ZI-2014-9650    4.104   -4.806

[25035 rows x 3 columns]

In [18]:
# table 7: shipping cost

shipping_cost_df = df.groupby('order_id')['shipping_cost'].sum().reset_index()

shipping_cost_df.to_sql(name='shipping_cost', con=engine, if_exists='append', index=False)
shipping_cost_df

           order_id  shipping_cost
0      AE-2011-9160           9.56
1      AE-2013-1130          60.18
2      AE-2013-1530           3.16
3      AE-2014-2840           8.04
4      AE-2014-3830          19.38
...             ...            ...
25030  ZI-2014-7160           3.72
25031  ZI-2014-7610           2.34
25032  ZI-2014-9540           0.35
25033  ZI-2014-9550           4.12
25034  ZI-2014-9650           0.80

[25035 rows x 2 columns]

In [19]:
# table 8: Discount
# weighted mean (on sales) of discount is used in order to take into account differences in order sizes 
wm = lambda x: np.average(x, weights=df.loc[x.index, "sales"])

discount_df = df.groupby(['order_id']).agg(discount=("discount", wm)).reset_index()

discount_df.to_sql(name='discount', con=engine, if_exists='append', index=False)
discount_df

           order_id  discount
0      AE-2011-9160       0.7
1      AE-2013-1130       0.7
2      AE-2013-1530       0.7
3      AE-2014-2840       0.7
4      AE-2014-3830       0.7
...             ...       ...
25030  ZI-2014-7160       0.7
25031  ZI-2014-7610       0.7
25032  ZI-2014-9540       0.7
25033  ZI-2014-9550       0.7
25034  ZI-2014-9650       0.7

[25035 rows x 2 columns]

In [20]:
# table 9: segments 
segment_id_df = pd.DataFrame(df.segment.unique(), columns=['segment'])
segment_id_df.insert(0, 'segment_id', range(1, 1 + len(segment_id_df)))
segment_id_df

segment_id_df.to_sql(name='segments', con=engine, if_exists='append', index=False)
segment_id_df

   segment_id      segment
0           1     Consumer
1           2    Corporate
2           3  Home Office

In [21]:
# table 10: customers
print(len(df['customer_id'].drop_duplicates()))
print(len(df['customer_id']))

# therefore need to remove duplicates in order to make customer_id the Primary Key

1590
51290

In [22]:
df4 = df[['customer_id','customer_name','segment']]
segment_id_list = [segment_id_df.segment_id[segment_id_df.segment== i].values[0] for i in df4.segment]

df4.insert(2, 'segment_id', segment_id_list)
df4

customer_id_df = df4.drop_duplicates('customer_id').fillna(-1).reset_index().drop('index',axis=1)
customer_id_df_final = customer_id_df.drop('segment',axis=1,inplace=False)

customer_id_df_final.to_sql(name='customers', con=engine, if_exists='append', index=False)
customer_id_df_final

     customer_id     customer_name  segment_id
0       RH-19495       Rick Hansen           1
1       JR-16210     Justin Ritter           2
2       CR-12730      Craig Reiter           1
3       KM-16375  Katherine Murray           3
4        RH-9495       Rick Hansen           1
...          ...               ...         ...
1585    SC-10800    Stuart Calhoun           1
1586     BD-1500   Bradley Drucker           1
1587     RC-9825       Roy Collins           1
1588     MG-7890  Michael Granlund           3
1589    ZC-11910  Zuschuss Carroll           1

[1590 rows x 3 columns]

In [23]:
# table 11: customer location
customer_location_df = df.drop_duplicates('customer_id').fillna(-1)[['customer_id','city','state', 'country']].reset_index().drop('index',axis=1)
customer_location_df

customer_location_df.to_sql(name='customer_location', con=engine, if_exists='append', index=False)
customer_location_df

     customer_id           city            state        country
0       RH-19495  New York City         New York  United States
1       JR-16210     Wollongong  New South Wales      Australia
2       CR-12730       Brisbane       Queensland      Australia
3       KM-16375         Berlin           Berlin        Germany
4        RH-9495          Dakar            Dakar        Senegal
...          ...            ...              ...            ...
1585    SC-10800     Benin City              Edo        Nigeria
1586     BD-1500          Lagos            Lagos        Nigeria
1587     RC-9825       Budapest         Budapest        Hungary
1588     MG-7890       Istanbul         Istanbul         Turkey
1589    ZC-11910      Maiduguri            Borno        Nigeria

[1590 rows x 4 columns]

In [24]:
# table 12: markets 
market_df = pd.DataFrame(df.market.unique(), columns=['market'])
market_df.insert(0, 'market_id', range(1, 1 + len(market_df)))
market_df 

market_df.to_sql(name='markets', con=engine, if_exists='append', index=False)
market_df

   market_id  market
0          1      US
1          2    APAC
2          3      EU
3          4  Africa
4          5    EMEA
5          6   LATAM
6          7  Canada

In [25]:
# table 13: countries
df5 = df[['country','market']]
market_list = [market_df.market_id[market_df.market == i].values[0] for i in df5.market]
df5.insert(2, 'market_id', market_list)
df5

country_df = df5.drop_duplicates('country').fillna(-1).reset_index().drop('index',axis=1)
country_df_final = country_df.drop('market',axis=1,inplace=False)

country_df_final.to_sql(name='countries', con=engine, if_exists='append', index=False)
country_df_final

               country  market_id
0        United States          1
1            Australia          2
2              Germany          3
3              Senegal          4
4          New Zealand          2
..                 ...        ...
142            Burundi          4
143          Macedonia          5
144            Eritrea          4
145  Equatorial Guinea          4
146            Armenia          5

[147 rows x 2 columns]

In [26]:
# table 14: ship modes 
ship_mode_df = pd.DataFrame(df.ship_mode.unique(), columns=['ship_mode'])
ship_mode_df.insert(0, 'ship_mode_id', range(1, 1 + len(ship_mode_df)))
ship_mode_df

ship_mode_df.to_sql(name='ship_modes', con=engine, if_exists='append', index=False)
ship_mode_df

   ship_mode_id       ship_mode
0             1        Same Day
1             2    Second Class
2             3     First Class
3             4  Standard Class

In [27]:
# table 15: shipping info

df6 = df[['order_id','ship_date','ship_mode']]
ship_mode_list = [ship_mode_df.ship_mode_id[ship_mode_df.ship_mode == i].values[0] for i in df6.ship_mode]
df6.insert(2, 'ship_mode_id', ship_mode_list)
df6

ship_info_df = df6.drop_duplicates('order_id').fillna(-1).reset_index().drop('index',axis=1)
ship_info_df_final = ship_info_df.drop('ship_mode',axis=1,inplace=False)

ship_info_df_final.to_sql(name='shipping_info', con=engine, if_exists='append', index=False)
ship_info_df_final

              order_id  ship_date  ship_mode_id
0       CA-2012-124891 2012-07-31             1
1        IN-2013-77878 2013-02-07             2
2        IN-2013-71249 2013-10-18             3
3      ES-2013-1579342 2013-01-30             3
4         SG-2013-4320 2013-11-06             1
...                ...        ...           ...
25030     ZI-2011-4350 2011-03-26             4
25031   MX-2014-169530 2014-06-11             3
25032    IN-2014-72327 2014-05-30             1
25033    IN-2014-57662 2014-08-10             4
25034   MX-2012-134460 2012-05-26             2

[25035 rows x 3 columns]

In [28]:
# 16: order location 
order_location_df = df.drop_duplicates('order_id').fillna(-1)[['order_id','city','state','country','postal_code']].reset_index().drop('index',axis=1)
order_location_df

order_location_df.to_sql(name='order_location', con=engine, if_exists='append', index=False)
order_location_df

,order_id,city,state,country,postal_code
0,CA-2012-124891,New York City,New York,United States,10024.0
1,IN-2013-77878,Wollongong,New South Wales,Australia,-1.0
2,IN-2013-71249,Brisbane,Queensland,Australia,-1.0
3,ES-2013-1579342,Berlin,Berlin,Germany,-1.0
4,SG-2013-4320,Dakar,Dakar,Senegal,-1.0
...,...,...,...,...,...
25030,ZI-2011-4350,Harare,Harare,Zimbabwe,-1.0
25031,MX-2014-169530,Bragança Paulista,São Paulo,Brazil,-1.0
25032,IN-2014-72327,Lucknow,Uttar Pradesh,India,-1.0
25033,IN-2014-57662,Townsville,Queensland,Australia,-1.0
25034,MX-2012-134460,Tipitapa,Managua,Nicaragua,-1.0

In [29]:
#close the connection
connection.close()

In [30]:
# drop all tables if needed
conn_url = 'postgresql://postgres:123456@localhost/global_store'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

stmt = """
    drop table categories cascade; drop table countries cascade;
    drop table customer_location cascade; drop table customers cascade;
    drop table discount cascade; drop table subcategories cascade;
    drop table financial_info cascade; drop table shipping_info cascade;
    drop table markets cascade; drop table shipping_cost cascade;
    drop table order_location cascade; drop table ship_modes cascade;
    drop table order_priority cascade; drop table segments cascade;
    drop table products cascade; drop table records cascade;



"""

# Execute the statement to create tables
#connection.execute(stmt)

#close the connection
connection.close()